app/controllers/artists_controller.rb

SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 2]]
---
  def show
    @artist = Artist.find(params[:id])
    if params[:song_id]
      if Song.where(id: params[:song_id]).present?