app/controllers/artists_controller.rb

  def show
    if params[:id].present?
      if Artist.where(id: params[:id]).empty?
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "artists" WHERE "artists"."id" = ?  [["id", 100]]