app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "artists" WHERE "artists"."id" = ?  [["id", 6]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id].present?
      if Artist.where(id: params[:artist_id]).empty?
        flash.alert = "Artist not found"
        redirect_to artists_path
      else
        @songs = Artist.find(params[:artist_id]).songs
      end
    else
      @songs = Song.all

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "songs" WHERE "songs"."id" = ?  [["id", 4]]
---
  def show
    if Song.where(id: params[:id]).empty?