app/controllers/songs_controller.rb

  def show
    if params[:artist_id]
      if Artist.find_by(id: params[:artist_id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]